# GetSegmentCount Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetSegmentCount Method
ViewSchedule Class See Also
---
Gets the total count of schedule segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public int GetSegmentCount()
```

Visual Basic
---
```text
Public Function GetSegmentCount As Integer
```

Visual C++
---
```text
public:
int GetSegmentCount()
```

# ### Return Value
The total count of schedule segments. 1 means the schedule is not split yet.
# Remarks
There will be at least one segment for a schedule.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace